problem_sets/cfd_suite/Docker/ESP/baseCase/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Set output format : choice of
//      xmgr
//      jplot
//      gnuplot
//      raw
//      vtk
//      csv
setFormat raw;

surfaceFormat raw;

interpolationScheme cell;

sets();

surfaces
(
    slice0
    {
        type            plane;    // always triangulated
        planeType pointAndNormal;
        //pointAndNormalDict
        //{
            basePoint       (7.5 1.5 0.0);
            normalVector    (1.0 0.0 0.0);
        //}
    }
); 

fields
(
    p
    U
);

type surfaces;
libs ("libsampling.so");

